In [2]:
import os
import pandas as pd
import numpy as np

In [3]:
data = "../Data Preparation/US_Data_subset.csv"
df = pd.read_csv(data)
df.head()

   Unnamed: 0   FOD1P  SCHL      WAGP  AGEP  COW
0           5  6107.0  21.0   39000.0    63  3.0
1          23  3600.0  21.0   16000.0    22  2.0
2          36  6107.0  21.0  100000.0    52  1.0
3          56  3700.0  21.0   41000.0    65  1.0
4          92  2300.0  21.0   15000.0    33  1.0

In [4]:
df=df.drop(["Unnamed: 0"], axis=1)
df.head()

    FOD1P  SCHL      WAGP  AGEP  COW
0  6107.0  21.0   39000.0    63  3.0
1  3600.0  21.0   16000.0    22  2.0
2  6107.0  21.0  100000.0    52  1.0
3  3700.0  21.0   41000.0    65  1.0
4  2300.0  21.0   15000.0    33  1.0

In [5]:

bachelors_tuition = 24116
masters_tuition = 35000
phd_tuition = 0

df["tuition"] = np.where(df.SCHL == 21.0, bachelors_tuition,
                                 np.where(df.SCHL == 22.0, masters_tuition,
                                          np.where(df.SCHL == 24.0, phd_tuition, "NA")))

df.head()

    FOD1P  SCHL      WAGP  AGEP  COW tuition
0  6107.0  21.0   39000.0    63  3.0   24116
1  3600.0  21.0   16000.0    22  2.0   24116
2  6107.0  21.0  100000.0    52  1.0   24116
3  3700.0  21.0   41000.0    65  1.0   24116
4  2300.0  21.0   15000.0    33  1.0   24116

In [6]:
# [ug-income, ug-std, master-income, master-std, phd-income, phd-std]
madeupdata={'Fine Art':[50000,5000,75000,10000,100000,12000],
            'Engineering':[80000,12000,150000,30000,179000,45000]}
madeupdata

{'Fine Art': [50000, 5000, 75000, 10000, 100000, 12000],
 'Engineering': [80000, 12000, 150000, 30000, 179000, 45000]}

In [7]:
madeupdata_df = pd.DataFrame(madeupdata)
madeupdata_df

   Fine Art  Engineering
0     50000        80000
1      5000        12000
2     75000       150000
3     10000        30000
4    100000       179000
5     12000        45000

In [8]:
madeupdata_df.columns

Index(['Fine Art', 'Engineering'], dtype='object')

In [9]:
for index, row in madeupdata_df.itterrows()
    if index%2 != 0:

SyntaxError: invalid syntax (<ipython-input-9-2110ce839378>, line 1)

In [39]:
madeupdata={'Fine Art':[50000,5000,75000,10000,100000,12000],
            'Engineering':[80000,12000,150000,30000,179000,45000],
           'tester': [500000,25000,900000,100000,1200000,75000]}
madeupdata

{'Fine Art': [50000, 5000, 75000, 10000, 100000, 12000],
 'Engineering': [80000, 12000, 150000, 30000, 179000, 45000],
 'tester': [500000, 25000, 900000, 100000, 1200000, 75000]}

In [40]:
degree = []
salaryrange = []
for x in madeupdata:
    degree.append(x)
    print(x)
    
    for i in range(len(madeupdata[x])):
        
        #madeuprange.append(y)
        
        if (i)%2 == 0:
            print(madeupdata[x][i])
            salaryrange.append(madeupdata[x][i]-madeupdata[x][i+1])
            salaryrange.append(madeupdata[x][i]+madeupdata[x][i+1])
            break
        
        #else: 
            ##madeuprange.append(y+(x+1))


salaryrange

Fine Art
50000
Engineering
80000
tester
500000

[45000, 55000, 68000, 92000, 475000, 525000]

In [ ]:
degree = []

listofsalaryrange = []
for x in madeupdata:
    degree.append(x)
    salaryrange=[]

    for i in range(len(madeu

In [41]:
degree = []

listofsalaryrange = []
for x in madeupdata:
    degree.append(x)
    salaryrange=[]

    for i in range(len(madeupdata[x])):


            if (i)%2 == 0:
               # print(madeupdata[x][i])
                salaryrange.append(madeupdata[x][i]-madeupdata[x][i+1])
                salaryrange.append(madeupdata[x][i]+madeupdata[x][i+1])
    
    listofsalaryrange.append(salaryrange)       

print(listofsalaryrange)
print(degree)

[[45000, 55000, 65000, 85000, 88000, 112000], [68000, 92000, 120000, 180000, 134000, 224000], [475000, 525000, 800000, 1000000, 1125000, 1275000]]
['Fine Art', 'Engineering', 'tester']